{
  "// section": "",
  "// Auto-split from 13-repo-issues-pr.json for maintainability.": "",
  "Actions performance metrics": "Метрики производительности Actions",
  "Actions permissions": "Права доступа Actions",
  "Actions secrets and variables": "Секреты и переменные Actions",
  "Actions usage metrics": "Метрики использования Actions",
  "All scheduled workflows will stop running": "Все запланированные воркфлоу перестанут запускаться",
  "All users that are not a member or owner of this repository will require approval to run workflows": "Всем пользователям, которые не являются участниками или владельцами этого репозитория, потребуется одобрение для запуска воркфлоу",
  "Allow Dependabot to open pull requests automatically to keep your dependencies up-to-date when new versions are available": "Разрешить Dependabot автоматически открывать пул-реквесты, чтобы поддерживать зависимости актуальными при выходе новых версий",
  "Allow GitHub Actions to create and approve pull requests": "Разрешить GitHub Actions создавать и одобрять пул-реквесты",
  "Allow actions by Marketplace": "Разрешить Actions из Marketplace",
  "Allow actions created by GitHub": "Разрешить Actions, созданные GitHub",
  "Allow all actions and reusable workflows": "Разрешить все Actions и переиспользуемые воркфлоу",
  "Allow or block specified actions and reusable workflows": "Разрешить или заблокировать указанные Actions и переиспользуемые воркфлоу",
  "Allow USERNAME actions and reusable workflows": "Разрешить Actions и переиспользуемые воркфлоу от USERNAME",
  "Allow USERNAME, and select non-USERNAME, actions and reusable workflows": "Разрешить Actions и переиспользуемые воркфлоу от USERNAME, а также выбрать некоторые не от USERNAME",
  "Any action or reusable workflow can be used, regardless of who authored it or where it is defined": "Можно использовать любой action или переиспользуемый воркфлоу — независимо от автора и места определения",
  "Any action or reusable workflow defined in a repository within USERNAME can be used": "Можно использовать любой action или переиспользуемый воркфлоу, определённый в репозитории внутри USERNAME",
  "Any action or reusable workflow that matches the specified criteria, plus those defined in a repository within USERNAME, can be used": "Можно использовать любой action или переиспользуемый воркфлоу, соответствующий заданным критериям, а также те, что определены в репозиториях внутри USERNAME",
  "Anyone with collaborator access to this repository can use these secrets and variables for actions. They are not passed to workflows that are triggered by a pull request from a fork": "Любой с доступом collaborator к этому репозиторию может использовать эти секреты и переменные в Actions. Они не передаются воркфлоу, которые запускаются пул-реквестом из форка",
  "Approval for running fork pull request workflows from contributors": "Одобрение запуска воркфлоу для пул-реквестов из форков от контрибьюторов",
  "Build, test, and deploy your code. Make code reviews, branch management, and issue triaging work the way you want. Select a workflow to get started": "Собирайте, тестируйте и деплойте код. Настройте code review, управление ветками и триаж проблем так, как вам нужно. Выберите воркфлоу, чтобы начать",
  "Choose the default permissions granted to the GITHUB_TOKEN when running workflows in this repository. You can specify more granular permissions in the workflow using YAML.": "Выберите права по умолчанию, выдаваемые GITHUB_TOKEN при запуске воркфлоу в этом репозитории. Более детальные права можно указать в воркфлоу через YAML.",
  "Choose whether GitHub Actions can create pull requests or submit approving pull request reviews": "Выберите, может ли GitHub Actions создавать пул-реквесты или отправлять одобряющие ревью пул-реквестов",
  "Configuring and managing workflows": "Настройка и управление воркфлоу",
  "Create custom workflows to control your project's life cycle processes": "Создайте собственные воркфлоу, чтобы управлять процессами жизненного цикла проекта",
  "Dependabot alerts are disabled": "Оповещения Dependabot отключены",
  "Dependabot alerts needs the dependency graph to be enabled, so we'll turn that on too": "Оповещения Dependabot требуют включённого графа зависимостей — мы включим и его",
  "Dependabot alerts •": "Оповещения Dependabot •",
  "Dependabot secrets": "Секреты Dependabot",
  "Dependabot security updates needs the dependency graph and Dependabot alerts to be enabled, so we'll turn them on too": "Обновления безопасности Dependabot требуют включённого графа зависимостей и оповещений Dependabot — мы включим и их",
  "Dependabot version updates": "Обновления версий Dependabot",
  "Disable actions": "Отключить Actions",
  "Enable Dependabot grouped security updates": "Включить сгруппированные обновления безопасности Dependabot",
  "Enable Dependabot version updates": "Включить обновления версий Dependabot",
  "Enabling this option will result in Dependabot automatically attempting to open pull requests to resolve every open Dependabot alert with an available patch": "Включение этой опции приведёт к тому, что Dependabot будет автоматически пытаться открывать пул-реквесты для исправления каждого открытого оповещения Dependabot, если доступен патч",
  "Environments are used by your workflows for deployments": "Окружения используются воркфлоу для деплоев",
  "Explore workflows": "Посмотреть воркфлоу",
  "Get started with GitHub Actions": "Начать с GitHub Actions",
  "GitHub Apps augment and extend your workflows on GitHub with commercial, open source, and homegrown tools": "GitHub Apps дополняют и расширяют ваши воркфлоу на GitHub коммерческими, open source и внутренними инструментами",
  "Grouped security updates needs the dependency graph, Dependabot alerts and Dependabot security updates to be enabled, so we'll turn them on too": "Сгруппированные обновления безопасности требуют включённых графа зависимостей, оповещений Dependabot и обновлений безопасности Dependabot — мы включим и их",
  "Groups all available updates that resolve a Dependabot alert into one pull request (per package manager and directory of requirement manifests). This option may be overridden by group rules specified in dependabot.yml -": "Группирует все доступные обновления, которые устраняют оповещение Dependabot, в один пул-реквест (для каждого менеджера пакетов и каталога манифестов зависимостей). Эта опция может быть переопределена правилами группировки в dependabot.yml —",
  "Host your own runners and customize the environment used to run jobs in your GitHub Actions workflows": "Размещайте свои раннеры и настраивайте окружение для выполнения задач в GitHub Actions",
  "Learn more about GitHub Actions": "Узнать больше о GitHub Actions",
  "Learn more about allowing specific actions and reusable workflows to run": "Узнать больше о разрешении запуска конкретных actions и переиспользуемых воркфлоу",
  "Learn more about configuring a dependabot.yml file": "Узнать больше о настройке файла dependabot.yml",
  "Learn more about self-hosted runners": "Узнать больше о self-hosted раннерах",
  "Learn more about setting up prebuilds": "Узнать больше о настройке предсборок",
  "Learn more about using runners": "Узнать больше об использовании раннеров",
  "Loading runner info": "Загрузка информации о раннере",
  "Manage Dependabot rules": "Управлять правилами Dependabot",
  "New to Actions? Start here. Learn the core concepts and how to get started": "Новичок в Actions? Начните здесь. Узнайте основные концепции и как начать",
  "Only users who are both new on GitHub and who have never had a commit or pull request merged into this repository will require approval to run workflows": "Одобрение для запуска воркфлоу потребуется только пользователям, которые одновременно новички на GitHub и у которых никогда не был слит коммит или пул-реквест в этот репозиторий",
  "Only users who have never had a commit or pull request merged into this repository will require approval to run workflows": "Одобрение для запуска воркфлоу потребуется только пользователям, у которых никогда не был слит коммит или пул-реквест в этот репозиторий",
  "Prebuild configuration": "Конфигурация prebuild",
  "Prebuild configurations speed up Codespace creations significantly by pre-executing all the tasks required to build your development environment": "Конфигурации prebuild значительно ускоряют создание Codespace, заранее выполняя все задачи, необходимые для подготовки окружения разработки",
  "Prebuilds are currently disabled because you've reached your Codespaces spending limit for this period. You can adjust it in billing settings": "Prebuild сейчас отключены, потому что вы достигли лимита расходов Codespaces за период. Лимит можно изменить в настройках биллинга",
  "Receive alerts for vulnerabilities that affect your dependencies and manually generate Dependabot pull requests to resolve these vulnerabilities": "Получайте оповещения об уязвимостях в зависимостях и вручную создавайте пул-реквесты Dependabot для их устранения",
  "Refresh Dependabot alerts": "Обновить оповещения Dependabot",
  "Require actions to be pinned to a full-length commit SHA": "Требовать закрепление actions на полный SHA коммита",
  "Reusable workflow examples": "Примеры переиспользуемых воркфлоу",
  "Runner type": "Тип раннера",
  "Runners": "Раннеры",
  "Save fork pull request workflows setting": "Сохранить настройку воркфлоу для пул-реквестов из форков",
  "Save workflow permissions settings": "Сохранить настройки прав воркфлоу",
  "Search workflows": "Искать воркфлоу",
  "Set up Terraform CLI in your GitHub Actions workflow": "Настроить Terraform CLI в вашем GitHub Actions воркфлоу",
  "Set up prebuild": "Настроить prebuild",
  "Simple workflow": "Простой воркфлоу",
  "The Actions tab is hidden and no workflows can run": "Вкладка Actions скрыта, и никакие воркфлоу не могут запускаться",
  "There are no prebuilds configured for this repository": "Для этого репозитория не настроены предсборки",
  "There are no runners configured": "Раннеры не настроены",
  "This is the runner default setup will use to run": "Это конфигурация по умолчанию, которую runner будет использовать для выполнения",
  "This may be used to force a \"cool-down\" period during heated discussions or prevent unwanted interactions": "Это можно использовать, чтобы принудительно включить период «остывания» во время горячих обсуждений или предотвратить нежелательные взаимодействия",
  "This workflow will build a docker container, publish and deploy it to Tencent Kubernetes Engine (USERNAME)": "Этот воркфлоу соберёт docker-контейнер, опубликует и развернёт его в Tencent Kubernetes Engine (USERNAME)",
  "To receive Dependabot alerts, you must first enable Dependabot alerts in": "Чтобы получать оповещения Dependabot, сначала включите оповещения Dependabot в",
  "Use a suggested workflow,": "Использовать предложенный воркфлоу,",
  "View workflow runs": "Посмотреть запуски воркфлоу",
  "Workflow details will appear here once your site has been deployed": "Детали воркфлоу появятся здесь после деплоя сайта",
  "Workflow permissions": "Права воркфлоу",
  "Workflows have read and write permissions in the repository for all scopes": "воркфлоу имеют права чтения и записи в репозитории для всех областей",
  "Workflows have read permissions in the repository for the contents and packages scopes only": "воркфлоу имеют права только на чтение в репозитории — лишь для contents и packages",
  "You can restrict repository interactions across your account in your": "Вы можете ограничить взаимодействия с репозиторием на уровне аккаунта в",
  "access to this repository can use these secrets for Dependabot": "доступ к этому репозиторию может использовать эти секреты для Dependabot",
  "approve the pull request workflow to be run": "одобрить запуск воркфлоу для пул-реквеста",
  "browse all workflows": "просмотреть все воркфлоу",
  "set up a workflow yourself": "настроить воркфлоу самостоятельно",
  "to run actions on your own servers": "чтобы выполнять actions на своих серверах",
  "DEVELOPER WORKFLOWS": "РАБОЧИЕ ПРОЦЕССЫ РАЗРАБОТЧИКОВ",
  "Automate any workflow": "Автоматизируйте любой воркфлоу",
  "Billable spend for Actions and Actions Runners for the selected timeframe. Applicable discounts cover Actions usage in public repositories and included usage for Actions minutes and storage": "Платные расходы на Actions и Actions Runners за выбранный период. Применимые скидки покрывают использование Actions в публичных репозиториях и включённое использование минут и хранилища Actions",
  "Create budgets to track your spending on products like Actions and Copilot": "Создавайте бюджеты, чтобы отслеживать расходы на продукты вроде Actions и Copilot",
  "Disable all dependabot self-hosted": "Отключить dependabot self-hosted везде",
  "Email a regular summary of Dependabot alerts for up to {N} of your repositories": "Отправлять регулярную сводку оповещений Dependabot по email для до {N} ваших репозиториев",
  "Enable all dependabot self-hosted": "Включить dependabot self-hosted везде",
  "Run Dependabot security and version updates on self-hosted Actions runners": "Запускать обновления безопасности и версий Dependabot на self-hosted Actions раннерах",
  "You're about to disable Dependabot alerts on all your repositories. This will also disable Dependabot security updates on those repositories": "Вы собираетесь отключить оповещения Dependabot во всех ваших репозиториях. Это также отключит обновления безопасности Dependabot в этих репозиториях",
  "You're about to disable Dependabot security updates on all your repositories": "Вы собираетесь отключить обновления безопасности Dependabot во всех ваших репозиториях",
  "You're about to disable dependabot self-hosted on all your repositories": "Вы собираетесь отключить dependabot self-hosted во всех ваших репозиториях",
  "You're about to disable dependency graph on all your private repositories. This will also disable Dependabot alerts and Dependabot security updates on those repositories": "Вы собираетесь отключить граф зависимостей во всех ваших приватных репозиториях. Это также отключит оповещения Dependabot и обновления безопасности Dependabot в этих репозиториях",
  "You're about to enable Dependabot alerts on all your repositories. Alerts require the dependency graph, so we'll also turn that on for all repositories. No notifications will be sent while Dependabot alerts are being enabled.": "Вы собираетесь включить оповещения Dependabot во всех ваших репозиториях. Оповещения требуют граф зависимостей, поэтому мы также включим его для всех репозиториев. Пока оповещения Dependabot включаются, уведомления отправляться не будут.",
  "You're about to enable Dependabot security updates on all your repositories. Dependabot security updates require the dependency graph and Dependabot alerts, so we'll also turn that on for all repositories": "Вы собираетесь включить обновления безопасности Dependabot во всех ваших репозиториях. Они требуют граф зависимостей и оповещений Dependabot, поэтому мы также включим их для всех репозиториев",
  "You're about to enable dependabot self-hosted on all your repositories. Dependabot self-hosted depends on Dependabot on Actions so we'll also turn that on for all repositories": "Вы собираетесь включить dependabot self-hosted во всех ваших репозиториях. Dependabot self-hosted зависит от Dependabot в Actions, поэтому мы также включим это для всех репозиториев"
}
